app/controllers/articles_controller.rb

SELECT `articles`.* FROM `articles`
---
    def index
        @articles = Article.all

SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
---
    def show
        @article = Article.find(params[:id])

SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
---
    def edit
        @article = Article.find(params[:id])

INSERT INTO `articles` (`title`, `text`, `created_at`, `updated_at`) VALUES ('art', 'art', '2017-02-09 02:03:40', '2017-02-09 02:03:40')
---
    def create
        @article = Article.new(article_params)
        if @article.save

SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 11 LIMIT 1
UPDATE `articles` SET `title` = 'Titulo raro', `text` = 'asd111', `updated_at` = '2017-02-13 23:26:58' WHERE `articles`.`id` = 11
---
    def update
        @article = Article.find(params[:id])

        if @article.update(article_params)

SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
DELETE FROM `articles` WHERE `articles`.`id` = 1
---
    def destroy
        @article = Article.find(params[:id])
        @article.destroy