app/controllers/bancos_controller.rb

SELECT `bancos`.* FROM `bancos`
---
    def index
        @banco = Banco.all